app/controllers/projects_controller.rb

   def create
    @project = Project.new(project_params)
    if !@project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 17 Dec 2013 14:11:57 UTC +00:00], ["name", "Project Name"], ["updated_at", Tue, 17 Dec 2013 14:11:57 UTC +00:00]]

  def update
    @project = Project.find(params[:id])
    if !@project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = 980190962  [["name", "MyString"], ["updated_at", Tue, 17 Dec 2013 14:25:02 UTC +00:00]]