app/controllers/tasks_controller.rb

  def index
    if params[:sorting]
      @done = Task.where(done: true).order(params[:sorting] => :desc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = 't' ORDER BY "tasks"."created_at" DESC

  def create

    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "deadline", "done", "duration", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)